In [ ]:
1.Series
2. DataFrame

In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

1.2.4

# Series

In [ ]:
list=[1,2,3,4,5]
label=['a','b','c','d','e']

In [ ]:
list

In [ ]:
type(list)

In [ ]:
ser=pd.Series(list,index=label)
ser

In [ ]:
Difference bw series and numpy array

>550k performance of pandas is better
<Numpy array are used

In [6]:
Marks={"maths":43,"Science":80,"Chemistry":95,"physics":46}
Ser=pd.Series(Marks)

In [7]:
Ser

maths        43
Science      80
Chemistry    95
physics      46
dtype: int64

In [8]:
Ser=pd.Series(Marks,index=["maths","Science","physics"])

# Series Indexing

In [10]:
Ser[1]

80

In [11]:
Ser["Science"]

80

## Slicing

In [12]:
Ser[1:3]

Science    80
physics    46
dtype: int64

In [14]:
Ser[1:]

Science    80
physics    46
dtype: int64

In [15]:
Ser.shape

(3,)

In [16]:
type(Ser)

pandas.core.series.Series

# Dataframe

In [22]:
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]
df=pd.DataFrame(list)
columns=["a","b","d","e"]
labels=["A","B","C","D"]
df=pd.DataFrame(list,index=labels,columns=columns)

In [23]:
df

    a   b   d   e
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [27]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [28]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df.shape

(4, 3)

In [31]:
df.columns

Index(['Name', 'Age', 'Branch'], dtype='object')

In [32]:
df1=df.rename(columns={"Name":"Name_new"})
df1

  Name_new  Age Branch
0   vishwa    2     AI
1   Saanvi    5     ML
2   chetan   10    ECE
3    priya   15    EEE

In [33]:
df.columns[[0,1]]

Index(['Name', 'Age'], dtype='object')

In [34]:
df.columns.values

array(['Name', 'Age', 'Branch'], dtype=object)

In [35]:
df.columns.values[2]="New_Branch"

In [36]:
df

     Name  Age New_Branch
0  vishwa    2         AI
1  Saanvi    5         ML
2  chetan   10        ECE
3   priya   15        EEE

In [38]:
df.drop("Name",axis=1,inplace=True)

In [39]:
df

   Age  New_Branch
0    2         NaN
1    5         NaN
2   10         NaN
3   15         NaN

In [42]:
df1=pd.DataFrame({"Name":["a","b","c","d"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"],"Place":["hyd","vellore","chennai","ap"]})

In [43]:
df1

  Name  Age Branch    Place
0    a    2     AI      hyd
1    b    5     ML  vellore
2    c   10    ECE  chennai
3    d   15    EEE       ap

In [ ]:
df3=

# Handle Missing Values

In [ ]:
1. delete the row column
2. imputing the value
Deletion of complete column only when 80 90 is null

In [ ]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi']})

In [ ]:
df1.isnull().any()

In [ ]:
df1.isnull().sum()

In [ ]:
df1.dropna(axis=1,inplace=True)

In [ ]:
#Imputing the values
Mean
Median
Mode

In [ ]:
df1["score1"]=df1["score1"].fillna(df1["score1"].mean())

In [44]:
df1["Name"].mode()

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
loc
iloc